Repository: hermet/enventor
Catalog: po/*.po
Languages: fr, it, sl

source: Failed to generate tmp folder!
fr: Impossible de générer un dossier temporaire !
it: Non ho potuto creare la directory temporanea!
sl: Neuspeh pri ustvarjanju začasne mape!

source: Cannot create a config folder "%s"
fr: Impossible de créer le dossier de configuration « %s »
it: Non ho potuto creare una directory di configurazione "%s"
sl: Ne morem ustvariti nastavitvene mape "%s"

source: Cannot create a enventor config folder "%s"
fr: Impossible de créer le dossier de configuration Enventor « %s »
it: Non ho potuto creare una directory di configurazione di enventor "%s"

source: Cannot save a config file "%s"
fr: Échec de l'enregistrement du fichier de configuration « %s »
it: Non ho potuto salvare un file di configurazione "%s"
sl: Ne morem shraniti nastavitvene datoteke "%s"

source: Cannot load a config file "%s"
fr: Échec du chargement du fichier de configuration « %s »
it: Non ho potuto caricare un file di configurazione "%s"
sl: Ne morem naložiti nastavitvene datoteke "%s"

source: Failed to allocate Memory!
fr: Impossible d'allouer de la mémoire !
it: Non ho potuto allocare memoria!
sl: Dodeljevanje spomina spodletelo!

source: EDC has been changed on the file system.
fr: EDC a été modifié sur le système de fichiers.
it: Il file EDC è cambiato sul file system.
sl: EDC je bil spremenjen na datotečnem sistemu.

source: Do you want to replace the contents?
fr: Voulez-vous remplacer le contenu ?
it: Vuoi sostituire il contenuto?
sl: Ali želite zamenjati vsebino?

source: Save As
fr: Enregistrer sous
it: Salva con nome
sl: Shrani kot

source: Replace
fr: Remplacer
it: Sostituisci
sl: Zamenjaj

source: Ignore
fr: Ignorer
it: Ignora
sl: Spreglej

source: File saved. "%s"
fr: Fichier « %s » enregistré.
it: File salvato. "%s"
sl: Datoteka shranjena. "%s"

source: Already saved. "%s"
fr: Fichier « %s » déjà enregistré.
it: Già salvato. "%s"
sl: Že shranjeno. "%s"

source: Invalid line number
fr: Numéro de ligne non valide
it: Numero di riga non valido
sl: Napačno število vrstice

source: Enventor Goto Line
fr: Enventor Se rendre à une ligne
it: Enventor va alla riga
sl: Enventor Skoči na vrstico

source: Go to Line
fr: Aller à la ligne
it: Vai alla riga
sl: Skoči na vrstico

source: Enter line number [1..%d]:
fr: Entrer le numéro de ligne [1..%d] :
it: Inserire il numero della rigar [1..%d]:
sl: Vnesi vrstico številka [1..%d]:

source: Failed to grab key - Escape
fr: Impossible d'accaparer la touche - Échap
it: Non ho potuto acquisire il tasto - Escape
sl: Zajetje tipke Esc spodletelo

source: Failed to grab key - %s
fr: Impossible d'accaparer la touche - %s
it: Non ho potuto acquisire il tasto -%s
sl: Zajetje znaka spodletelo - %s

source: Double click part to confirm.(Esc = cancel, Direction Key = move item per pixel,Ctrl = disable auto-aligning)
fr: Double clic sur la partie pour confirmer. (Échap = annuler, touches de direction = déplacer d'un pixel à la fois, Ctrl = désactiver l'auto-alignement)
it: Doppio clic sulla parte per confermare. (Esc = annulla, tasti direzione = sposta un pixel per volta, Ctrl = disabilita allineamento automatico)

source: Add a Rect part to the live view.<br>A Rect part is used as a solid color<br>component or clipping other components.
fr: Ajouter une partie Rect à l'aperçu.<br>Cette partie est utilisée comme un élément de couleur<br>unie ou pour cacher d'autres éléments.
it: Aggiunge una parte Rect all'anteprima.<br>Una parte Rect viene usata come un componente<br>di colore pieno o per il clipping di altri componenti.

source: Add a Text part to the live view.<br>A Text part is used for plain text.
fr: Ajouter une partie Text à l'aperçu.<br>Cette partie est utilisée pour le texte ordinaire.
it: §Aggiunge una parte Text all'anteprima.<br> Una parte Text viene usata per il testo semplice.

source: Add an Image part to the live view.<br>An Image part contains a single image<br>resource, usually an image file.
fr: Ajouter une partie Image à l'aperçu.<br>Cette partie contient une seule ressource,<br>généralement un fichier image.
it: Aggiunge una parte Image all'anteprima.<br> Una parte Image contiene solo una risorsa immagine,<br> di solito un file

source: Add a Swallow part to the live view.<br>A Swallow part is a placeholder for<br>objects that you may want to<br>include in the layout later.
fr: Ajouter une partie Swallow à l'aperçu.<br>Cette partie est un espace réservé pour<br>des objets que vous souhaitez inclure <br>plus tard dans votre composition.
it: Aggiunge una parte Swallow all'anteprima.<br>Una parte Swallow è un segnaposto per oggetti che<br>possono essere inclusi nel layout successivamente.

source: Add a Textblock part to the live view.<br>A Textblock part is a rich-text part<br>that can show big chunks of text.
fr: Ajouter une partie Textblock à l'aperçu.<br>Cette partie affiche du texte formaté pouvant<br>contenir de gros blocs de texte.
it: Aggiunge una parte Textblok all'anteprima.<br>Una parte Textblock contiene testo formattato e<br>può visualizzare grossi spezzoni di testo.

source: Add a Spacer part to the live view.<br>A Spacer part is an anchor to locate <br>other parts. It is invisible and<br>normally used for padding.
fr: Ajouter une partie Spacer à l'aperçu.<br>Cette partie est un ancrage pour accueillir<br>d'autres éléments. Elle est invisible et<br>sert principalement pour le padding.
it: Aggiunge una parte Spacer all'anteprima.<br>Una parte Spacer è un'ancora per altre parti.<br>È invisibile e viene usata normalmente per il padding.

source: Faild to allocate Memory!
fr: Impossible d'allouer de la mémoire !
it: Non ho potuto allocare memoria!
sl: Dodeljevanje spomina spodletelo!

source: Font Size: %1.1fx
fr: Taille de la police : %1.1fx
it: Dimensione font: %1.1fx
sl: Velikost pisave: %1.1fx

source: Cannot create temporary diretory "%s"
fr: Impossible de créer le dossier temporaire « %s »
it: Non ho potuto creare la directory temporanea "%s"

source: New File: Choose a Template
fr: Nouveau fichier : choisir un modèle
it: Nuovo file: scegliere un modello

source: Cancel
fr: Annuler
it: Annulla
sl: Prekliči

source: You have unsaved changes.
fr: Des changements n'ont pas été enregistrés.
it: Ci sono modifiche non salvate.

source: Do you want to save the changes?
fr: Voulez-vous enregistrer les modifications ?
it: Volete salvare le modifiche?

source: Save
fr: Enregistrer
it: Salva
sl: Shrani

source: Discard
fr: Abandonner
it: Scarta
sl: Zavrži

source: Choose a file to save
fr: Choisir un fichier à enregistrer
it: Scegliere un file da salvare
sl: Izberite datoteko za shranjevanje

source: Failed to save: %s.
fr: Impossible d'enregistrer : %s.
it: Impossibile salvare: %s.
sl: Neuspeh pri shranjevanju: %s.

source: Support only .edc file.
fr: Seuls les fichiers .edc sont pris en charge.
it: Solo i file .edc sono supportati.
sl: Podpora le za .edc datoteke.

source: Choose a file to load.
fr: Choisir un fichier à charger.
it: Scegliere un file da aprire.
sl: Izberite datoteko za naložitev.

source: Failed to load: %s.
fr: Impossible de charger : %s.
it: Impossibile aprire: %s.
sl: Neuspeh pri nalaganju: %s.

source: Save File: Choose a EDC
fr: Enregistrer un fichier : choisir un EDC
it: Salva file: scegliere un EDC
sl: Shrani datoteko: Izberi EDC

source: Close
fr: Fermer
it: Chiudi
sl: Zapri

source: Load File: Choose a EDC
fr: Charger un fichier : choisir un EDC
it: Apri file: scegliere un EDC
sl: Naloži datoteko : Izberi EDC

source: Load
fr: Charger
it: Apri
sl: Naloži

source: New
fr: Nouveau
it: Nuovo
sl: Nov

source: Settings
fr: Configuration
it: Impostazioni
sl: Nastavitve

source: Help
fr: Aide
it: Aiuto
sl: Pomoč

source: Exit
fr: Quitter
it: Esci
sl: Izhod

source: Cannot find templates folder! "%s"
fr: Dossier des modèles « %s » introuvable !
it: Non riesco a trovare la cartella dei modelli! "%s"
sl: Ne najdem mape predlog! "%s"

source: Cannot find file! "%s"
fr: Fichier « %s » introuvable !
it: Non riesco a trovare il file! "%s"
sl: Ne najdem datoteke! "%s"

source: %d matches replaced
fr: %d correspondances remplacées
it: %d corrispondenze sostituite
sl: %d zadetki zamenjani

source: No "%s" in the text
fr: Aucun « %s » dans le texte
it: Non esiste "%s" nel testo
sl: Ni "%s" v besedilu

source: Previous
fr: Précédent
it: Precedente

source: Next
fr: Suivant
it: Successivo

source: Enventor Search
fr: Enventor Rechercher
it: Ricerca di Enventor
sl: Enventor Iskanje

source: Find/Replace
fr: Rechercher / Remplacer
it: Trova/Sostituisci
sl: Najdi/Zamenjaj

source: Replace All
fr: Remplacer tout
it: Sostituisci tutto
sl: Zamenjaj vse

source: Preferences
fr: Préférences
it: Preferenze
sl: Prednostne nastavitve

source: Text Editor
fr: Éditeur de texte
it: Editor di testo
sl: Urejevalnik besedil

source: EDC Build
fr: Construire EDC
it: Compila EDC
sl: EDC izgradnja

source: Apply
fr: Appliquer
it: Applica
sl: Uveljavi

source: Reset
fr: Rétablir
it: Reimposta
sl: Obnovi

source: View zoom level (Ctrl + Mouse Wheel)<br>Zoom the live view in or out.
fr: Niveau de zoom (Ctrl+molette souris)<br>Agrandir ou réduire l'aperçu.
it: Livello dello zoom (Ctrl + rotella mouse)<br>Ingrandisce e rimpicciolisce l'anteprima

source: Resize the width and height of the live view.
fr: Redimensionner la largeur et la hauteur de l'aperçu.
it: Ridimensiona larghezza e altezza dell'anteprima

source: Swap the width and height of the live view.
fr: Interchanger la largeur et la hauteur de l'aperçu.
it: Scambia larghezza e altezza dell'anteprima

source: Mouse cursor position in live view.<br>Absolute coordinate | Relative coordinate.
fr: Position du pointeur de la souris dans l'aperçu.<br>Coordonnée absolue | Coordonnée relative.
it: Posizione puntatore nell'anteprima.<br> Coordinate assolute | Coordinate relative.

source: Name of the current editing group.
fr: Nom du groupe en cours d'édition.
it: Nome del gruppo attualmente in modifica

source: Cursor line number : Max line number
fr: Numéro de ligne du curseur : nombre de lignes max.
it: Numero riga del cursore : numero massimo di righe

source: Failed to open file "%s"
fr: Impossible d'ouvrir le fichier « %s »
it: Non ho potuto aprire il file "%s"
sl: Neuspeh pri odpiranju datoteke "%s"

source: Double click a keyword to change its color :
fr: Double clic sur un mot-clé pour changer sa couleur :
it: Doppio clic su una keyword per cambiarne il colore
sl: Dvoklikni ključno besedo za spremembo njene barve :

source: Font Name
fr: Nom de la police
it: Nome del font
sl: Ime pisave

source: Font Style
fr: Style de la police
it: Stile del font
sl: Slog pisave:

source: Redo text.
fr: Répéter le texte.
it: Ripeti testo.
sl: Ponovno uveljavi besedilo.

source: No text to be redo.
fr: Aucun texte à répéter.
it: Nessun testo da ripetere.
sl: Ni besedila za ponovno uveljavitev.

source: Undo text.
fr: Annuler le texte.
it: Annulla testo
sl: Razveljavi besedilo.

source: No text to be undo.
fr: Aucun texte à annuler.
it: Nessun testo da annullare
sl: Ni besedila za razveljavitev.

source: Part highlighting (Ctrl + H)<br>Show a highlight effect on the selected part<br>in the live view.
fr: Surbrillance (Ctrl+H)<br>Mise en évidence de la partie<br>sélectionnée dans l'aperçu.
it: Evidenziazione parte (Ctrl + H)<br>Mostra un effetto evidenziazione sulla<br>parte selezionata nell'anteprima.

source: Dummy parts (Ctrl + U)<br>Display virtual images for the swallow and<br>spacer parts.
fr: Maquette (Ctrl+U)<br>Affiche des images factices pour les<br>parties Swallow et Spacer.
it: Parti fittizie (Ctrl + U)<br>Mostra immagini virtuali per le parti<br>Swallow e Spacer.

source: Wireframes (Ctrl + W)<br>Display wireframes to identify the parts<br>boundaries.
fr: Encadrement (Ctrl+W)<br>Affiche des guides pour délimiter<br>les différentes parties.
it: Incorniciamento (Ctrl + W)<br>Mostra una cornice che identifica i<br>confini della parte.

source: Mirror mode (Ctrl + M)<br>Invert the layout horizontally and review<br>the designed layout in RTL(right-to-left)<br>LTR(left-to-right) settings.
fr: Miroir (Ctrl+M)<br>Inverse horizontalement la composition et permet de<br>tester les dispositions RTL (de droite à gauche)<br>et LTR (de gauche à droite).
it: Modalità specchio (§Ctrl + M)<br>Inverte orizzontalmente il layout e ne rivede le<br>impostazioni RTL (da destra a sinistra) e LTR<br>(da sinistra a destra).

source: Save the file (Ctrl + S)<br>Save the current script to a file.
fr: Enregistrer le fichier (Ctrl+S)<br>Enregistre le script actuel dans un fichier.
it: Salva il file (Ctrl + S)<br>Salva l'attuale script in un file.

source: Undo text (Ctrl + Z)
fr: Annuler texte (Ctrl+Z)
it: Annulla testo (Ctrl + Z)

source: Redo text (Ctrl + R)
fr: Répéter texte (Ctrl+R)
it: Ripeti testo (Ctrl + R)

source: Find/Replace (Ctrl + F)<br>Find or replace text.
fr: Chercher / Remplacer (Ctrl+F)<br>Cherche ou remplace du texte.
it: Trova/Sostituisci (Ctrl + F)<br>Trova o sostituisce il testo.

source: Go to line (Ctrl + L)<br>Open the Go to window to move the cursor<br>line position.
fr: Aller à la ligne (Ctrl+L)<br>Ouvre une boîte de dialogue pour déplacer<br>le curseur à la ligne indiquée.
it: Vai alla riga (Ctrl + L)<br>Apre la fienstre "Vai a" per spostare la<br>riga in cui è posizionato il cursore.

source: Line numbers<br>Display the script line numbers.
fr: Numéros de lignes<br>Affiche les numéros de lignes.
it: Numeri di riga<br>Visualizza i numeri di riga dello script.

source: Insert a code snippet (Ctrl + T)<br>Enventor chooses the best code with regards<br>to the current editing context. For instance,<br>if the cursor is inside a part section,<br>description code is generated.
fr: Insérer un extrait de code (Ctrl+T)<br>Enventor sélectionne le code le plus adapté au contexte<br>actuel. Par exemple, si le curseur se trouve<br>dans une section Part, un code de<br>description est généré.
it: Inserisci codice (Ctrl + T)<br>Enventor sceglie il codice migliore sulla base del<br>contesto attuale. Ad esempio, se il cursore si trova<br>nella sezione "part" viene generato un codice<br>"description".

source: Console box (Alt + Down)<br>Display the console box, which shows the EDC<br>build logs, such as error messages. It pops<br>up automatically when compliation errors occur.
fr: Console (Alt+Flèche bas)<br>Affiche les journaux EDC tels les messages d'erreur.<br>Elle apparaît automatiquement quand des<br>erreurs de compilation se produisent.
it: Box console (Alt + Giù)<br>Visualizza il box console che mostra i messaggi del log<br>di compilazione dell'EDC, come quelli di errore. Viene<br>visualizzato automaticamente quando avviene un errore di<br>compilazione.

source: File browser (F9)<br>Display the file browser, which shows a file list<br>in current workspace.
fr: Navigateur de fichiers (F9)<br>Affiche le navigateur pour lister les fichiers<br>de l'espace de travail actuel.
it: Navigatore file (F9)<br>Visualizza un navigatore di file che mostra una lista<br>dei file nell'attuale spazio di lavoro.

source: EDC navigator (F10)<br>Display the EDC navigator, which shows the current<br>group hierarchy tree that contains parts,<br>descriptions and programs lists.
fr: Navigateur EDC (F10)<br>Affiche le navigateur montrant l'arbre hiérarchique de<br>l'EDC actuel qui contient les parties, descriptions<br>et listes de programmes.
it: Navigatore EDC (F10)<br>Visualizza un navigatore di EDC che mostra l'albero<br>gerarchico dell'attuale EDC che contiene l'elenco di<br>parti, descrizioni e programmi.

source: File tab (F11)<br>Display the file tab in the bottom area<br>It shows an opened file list to switch<br>files quickly. to switch files quickly.
fr: Onglet (F11)<br>Affiche l'onglet de la zone inférieure qui regroupe<br>les fichiers EDC et permet de passer<br>rapidement de l'un à l'autre.
it: Etichette file (F11)<br>Visualizza le etichette dei file nell'area in fondo per<br>passare rapidamente da un file aperto all'altro.

source: Enventor menu (Esc)<br>Open the Enventor main menu.
fr: Enventor Menu (Échap)<br>Ouvre le menu principal d'Enventor.
it: Menù di Enventor (Esc)<br>Apre il menù principale di Enventor.

source: Part highlighting enabled.
fr: Mode surbrillance activé.
it: Evidenziazione parte abilitata.

source: Part highlighting disabled.
fr: Mode surbrillance désactivé.
it: Evidenziazione parte disabilitata.

source: Dummy parts enabled.
fr: Mode maquette activé.
it: Parti fittizie abilitate.

source: Dummy parts disabled.
fr: Mode maquette désactivé.
it: Parti fittizie disabilitate.

source: Wireframes enabled.
fr: Mode encadrement activé.
it: Incorniciamenti abilitati.

source: Wireframes disabled.
fr: Mode encadrement désactivé.
it: Incorniciamenti disabilitati.

source: Mirror mode enabled.
fr: Mode miroir activé.
it: Modalità specchio abilitata.

source: Mirror mode disabled.
fr: Mode miroir désactivé.
it: Modalità specchio disabilitata.

source: Insertion of template code is disabled while in Live Edit mode
fr: L'insertion de modèles de code est désactivée en mode Live Edit
it: L'inserimento di modelli di codice è disabilitata in modalità Live Edit
sl: Med načinom urejanja v živo, je vstavljanje kode predloge onemogočeno

source: Template code inserted, (%s)
fr: Insertion du modèle de code, (%s)
it: Modello di codice inserito, (%s)
sl: Vstavljena koda predloge, (%s)

source: Can't insert template code here. Move the cursor inside the "Collections,Images,Parts,Part,Programs" scope.
fr: L'insertion d'un modèle de code n'est pas possible ici. Déplacer le curseur dans la section « Collections,Images,Parts,Part,Programs ».
it: Impossibile inserire modelli di codice qui. Spostare il cursore in "Collections,Images,Parts,Part,Programs\"
sl: Tukaj ne morem vstaviti kode predloge. Premaknite kurzor znotraj okvirja "Zbirke,Slike,Deli,Del,Programi".

source: Ok
sl: V Redu

source: Double click part to confirm. (Esc = cancel, Direction Key = move item per pixel, Ctrl = disable auto-aligning)
sl: Dvoklikni del za potrditev. (Esc = preklic, Smerna tipka = premikanje en predmet na piksel, Ctrl = onemogoči samodejno poravnavo)

source: Auto Completion Enabled.
sl: Samodokončanje omogočeno.

source: Auto Completion Disabled.
sl: Samodokončanje onemogočeno.

source: Auto Indentation Enabled.
sl: Samozamik omogočen.

source: Auto Indentation Disabled.
sl: Samozamik onemogočen.

source: New File: Choose a template
sl: Nova datoteka: izberi predlogo

source: Without save, you will lose last changes!
sl: Brez shranitve boste izgubili zadnje spremembe!

source: Will you save changes?
sl: Ali boste shranili spremembe?

source: Backward
sl: Nazaj

source: Forward
sl: Naprej

source: Font Size
sl: Velikost pisave:

source: Part Highlighting (Ctrl + H)
sl: Poudarjanje dela (Ctrl + H)

source: Dummy Parts (Ctrl + W)
sl: Butasti deli (Ctrl + W)

source: Mirror Mode (Ctrl + M)
sl: Način ogledala (Ctrl + M)

source: Save File (Ctrl + S)
sl: Shrani datoteko (Ctrl + S)

source: Undo Text (Ctrl + Z)
sl: Razveljavi besedilo (Ctrl + Z)

source: Redo Text (Ctrl + R)
sl: Ponovno uveljavi besedilo (Ctrl + R)

source: Find/Replace (Ctrl + F)
sl: Najdi/Zamenjaj (Ctrl + F)

source: Goto Lines (Ctrl + L)
sl: Pojdi na vrstice (Ctrl + L)

source: Line Numbers (F5)
sl: Številke vrstic (F5)

source: Insert Template (Ctrl + T)
sl: Vstavi predlogo (Ctrl + T)

source: Console Box (Alt + Down)
sl: Konzolna škatla (Alt + Down)

source: File Browser (F9)
sl: Brskalnik datotek (F9)

source: Status (F11)
sl: Stanje (F11)

source: Enventor Menu (Esc)
sl: Enventor Meni (Esc)

source: Part Highlighting Enabled.
sl: Omogočeno poudarjanje delov.

source: Part Highlighting Disabled.
sl: Onemogočeno poudarjanje delov.

source: Dummy Parts Enabled.
sl: Omogočeni butasti deli.

source: Dummy Parts Disabled.
sl: Onemogočeni butasti deli.

source: Mirror Mode Enabled.
sl: Omogočen način ogledala.

source: Mirror Mode Disabled.
sl: Onemogočen način ogledala.
